Revit 2027 API
BuiltInFailures.DesignOptionFailures.NeverInOptionWarn Property
 Some types of elements can't belong to an Option. Elements of these types were not added to this Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NeverInOptionWarn { get; }
Public Shared ReadOnly Property NeverInOptionWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NeverInOptionWarn {
	FailureDefinitionId^ get ();
}
static member NeverInOptionWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace